FelipeCorso/PIC18F4620-batalha-naval/batalha_naval.c
// PIC18F4620 Configuration Bit Settings
// 'C' source line config statements
// CONFIG1H
#pragma config OSC = HS         // Oscillator Selection bits (HS oscillator)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOREN = SBORDIS  // Brown-out Reset Enable bits (Brown-out Reset enabled in hardware only (SBOREN is disabled))
#pragma config BORV = 3         // Brown Out Reset Voltage bits (Minimum setting)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = PORTC   // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = OFF     // Stack Full/Underflow Reset Enable bit (Stack full/underflow will not cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-003FFFh) not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (004000-007FFFh) not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (008000-00BFFFh) not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (00C000-00FFFFh) not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-003FFFh) not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (004000-007FFFh) not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (008000-00BFFFh) not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (00C000-00FFFFh) not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot Block (000000-0007FFh) not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-003FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (004000-007FFFh) not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (008000-00BFFFh) not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (00C000-00FFFFh) not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot Block (000000-0007FFh) not protected from table reads executed in other blocks)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>

unsigned int tecla;
unsigned int municoes = 10;
unsigned char input_config[2];
unsigned char ENTER[2] = {13, 0};
unsigned int random = 0;
unsigned const int encouracados_posicoes = 5;
unsigned int encouracados_qtd = 2;
unsigned int encouracados_acertos = 0;

unsigned const int porta_avioes_posicoes = 6;
unsigned int porta_avioes_qtd = 1;
unsigned int porta_avioes_acertos = 0;

unsigned const int hidroavioes_posicoes = 3;
unsigned int hidroavioes_qtd = 5;
unsigned int hidroavioes_acertos = 0;

unsigned const int submarinos_posicoes = 1;
unsigned int submarinos_qtd = 4;
unsigned int submarinos_acertos = 0;

unsigned const int cruzadores_posicoes = 2;
unsigned int cruzadores_qtd = 3;
unsigned int cruzadores_acertos = 0;

unsigned const int tamanho_matriz = 15;
signed int matriz[15][15];
unsigned char printLinhaColuna;
unsigned char JOGO_DA_VELHA = 35;

struct Acertos {
    int lin;
    int col;
    int acertou;
};

struct {
    struct Acertos posicoes[encouracados_posicoes];
} encouracados[2];

struct {
    struct Acertos posicoes[porta_avioes_posicoes];
} porta_avioes[1];

struct {
    struct Acertos posicoes[hidroavioes_posicoes];
} hidroavioes[5];

struct {
    struct Acertos posicoes[submarinos_posicoes];
} submarinos[4];

struct {
    struct Acertos posicoes[cruzadores_posicoes];
} cruzadores[3];

unsigned int getPosicao() {
    return rand() / 2184;
}

unsigned int isPosicaoValida(unsigned int *linha, unsigned int *coluna, unsigned int tamanho) {
    //unsigned const int valorLinha = *linha;
    //unsigned const int valorColuna = *coluna;
    int valorPosicao;
    valorPosicao = matriz[*linha][*coluna];
    if (valorPosicao != -1) {
        (*coluna)++;
        return 0;
    }
    if ((*coluna > (tamanho_matriz - tamanho))) {
        *coluna = 0;
        (*linha)++;
        if (*linha > tamanho_matriz) {
            *linha = 0;
        }
        return 0;
    }
    return 1;
}

void escreverMatriz(unsigned int linha, unsigned int coluna, unsigned char valor) {
    matriz[linha][coluna] = valor;
}

void initMatriz() {
    unsigned int i = 0;
    unsigned int j = 0;
    for (i = 0; i < tamanho_matriz; i++) {
        for (j = 0; j < tamanho_matriz; j++) {
            matriz[i][j] = -1;
        }
    }
}

void initEncouracados() {
    unsigned int i = 0;
    unsigned int j = 0;
    unsigned int linha = 0;
    unsigned int coluna = 0;
    unsigned int posicaoValida = 0;

    linha = getPosicao();
    coluna = getPosicao();
    posicaoValida = isPosicaoValida(&linha, &coluna, encouracados_posicoes);
    while (!posicaoValida) {
        posicaoValida = isPosicaoValida(&linha, &coluna, encouracados_posicoes);
    }

    for (i = 0; i < encouracados_qtd; i++) {
        for (j = 0; j < encouracados_posicoes; j++) {
            encouracados[i].posicoes[j].lin = linha;
            encouracados[i].posicoes[j].col = coluna;
            encouracados[i].posicoes[j].acertou = 0;
            //escreverMatriz(linha, coluna, '0');
            escreverMatriz(linha, coluna, 'e');
            coluna++;
        }

        if ((i + 1) < encouracados_qtd) {
            linha = getPosicao();
            coluna = getPosicao();
            posicaoValida = isPosicaoValida(&linha, &coluna, encouracados_posicoes);
            while (!posicaoValida) {
                posicaoValida = isPosicaoValida(&linha, &coluna, encouracados_posicoes);
            }
        }
    }
}

