FelipeCorso/PIC18F4620-batalha-naval/batalha_naval.c
unsigned int isAfundouSubmarino(unsigned int submarinoAcertado) {
    unsigned int j = 0;
    for (j = 0; j < submarinos_posicoes; j++) {
        if (submarinos[submarinoAcertado].posicoes[j].acertou != 1) {
            return 0;
        }
    }
    return 1;
}

unsigned int isAcertouCruzador(unsigned int linha, unsigned int coluna) {
    unsigned int i = 0;
    unsigned int j = 0;
    for (i = 0; i < cruzadores_qtd; i++) {
        for (j = 0; j < cruzadores_posicoes; j++) {
            if (cruzadores[i].posicoes[j].lin == linha &&
                    cruzadores[i].posicoes[j].col == coluna &&
                    cruzadores[i].posicoes[j].acertou == 0) {
                cruzadores[i].posicoes[j].acertou = 1;
                return i;
            }
        }
    }
    return -1;
}

unsigned int isAfundouCruzador(unsigned int cruzadorAcertado) {
    unsigned int j = 0;
    for (j = 0; j < cruzadores_posicoes; j++) {
        if (cruzadores[cruzadorAcertado].posicoes[j].acertou != 1) {
            return 0;
        }
    }
    return 1;
}

void verificarJogada(unsigned int linha, unsigned int coluna) {
    signed int encouracadoAcertado;
    encouracadoAcertado = isAcertouEncouracado(linha, coluna);
    if (encouracadoAcertado != -1) {
        municoes += 2;
        executarSomAcertou();
        escreverMatriz(linha, coluna, 'E');
        if (isAfundouEncouracado(encouracadoAcertado)) {
            municoes += 3;
            encouracados_acertos++;
            executarSomAfundou();
        }
    } else {
        signed int portaAvioesAcertado;
        portaAvioesAcertado = isAcertouPortaAvioes(linha, coluna);
        if (portaAvioesAcertado != -1) {
            municoes += 2;
            executarSomAcertou();
            escreverMatriz(linha, coluna, 'P');
            if (isAfundouPortaAvioes(portaAvioesAcertado)) {
                municoes += 3;
                porta_avioes_acertos++;
                executarSomAfundou();
            }
        } else {
            signed int hidroAviaoAcertado;
            hidroAviaoAcertado = isAcertouHidroAviao(linha, coluna);
            if (hidroAviaoAcertado != -1) {
                municoes += 2;
                executarSomAcertou();
                escreverMatriz(linha, coluna, 'H');
                if (isAfundouHidroAviao(hidroAviaoAcertado)) {
                    municoes += 3;
                    hidroavioes_acertos++;
                    executarSomAfundou();
                }
            } else {
                signed int submarinoAcertado;
                submarinoAcertado = isAcertouSubmarino(linha, coluna);
                if (submarinoAcertado != -1) {
                    municoes += 2;
                    executarSomAcertou();
                    escreverMatriz(linha, coluna, 'S');
                    if (isAfundouSubmarino(submarinoAcertado)) {
                        municoes += 3;
                        submarinos_acertos++;
                        executarSomAfundou();
                    }
                } else {
                    signed int cruzadorAcertado;
                    cruzadorAcertado = isAcertouCruzador(linha, coluna);
                    if (cruzadorAcertado != -1) {
                        municoes += 2;
                        executarSomAcertou();
                        escreverMatriz(linha, coluna, 'C');
                        if (isAfundouCruzador(cruzadorAcertado)) {
                            municoes += 3;
                            cruzadores_acertos++;
                            executarSomAfundou();
                        }
                    } else {
                        escreverMatriz(linha, coluna, '.');
                    }
                }
            }
        }
    }

}

void main() {
    unsigned int printMunicoes;
    unsigned int linha;
    unsigned int coluna;

    UART1_Init(19200); // Initialize UART module at 19200 bps

    initRandom();
    initMatriz();
    initEncouracados();
    initPortaAvioes();
    initHidroavioes();
    initSubmarinos();
    initCruzadores();

    imprimirMatriz(1, 0);
    quebraLinha();

    while (municoes > 0) {

        UART1_Write_Text("Informe uma linha: ");
        while (!UART1_Data_Ready());
        UART1_Read_Text(input_config, ENTER, 30);
        UART1_Write_Text(input_config);
        linha = atoi(input_config);

        quebraLinha();

        UART1_Write_Text("Informe uma coluna: ");
        while (!UART1_Data_Ready());
        UART1_Read_Text(input_config, ENTER, 30);
        UART1_Write_Text(input_config);
        coluna = atoi(input_config);

        quebraLinha();

        if (coluna == 99) {
            imprimirMatriz(0, 1);
        } else {
            municoes--;
            linha = linha - 1;
            coluna = coluna - 1;
            verificarJogada(linha, coluna);

			quebraLinha();
			
            imprimirPontuacao();

            if (isGanhou()) {
                imprimirMatriz(0, 1);
                quebraLinha();
                imprimirPontuacao();
                return;
            } else {
                imprimirMatriz(0, 0);
            }
        }
        quebraLinha();
    }

    if (!municoes) {
        UART1_Write_Text("Sem municao");
        quebraLinha();
        UART1_Write_Text("GAME OVER!!!");
    } else {
        UART1_Write_Text("Parabens! Voce ganhou.");
        quebraLinha();
        UART1_Write_Text("Pontuacao: ");
        IntToStr(municoes, printMunicoes);
        UART1_Write_Text(printMunicoes);
    }

}
